GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k40.inc
// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0EE3h
// bitfield definitions
PMD2_ZCDMD_POSN                          equ 0000h
PMD2_ZCDMD_POSITION                      equ 0000h
PMD2_ZCDMD_SIZE                          equ 0001h
PMD2_ZCDMD_LENGTH                        equ 0001h
PMD2_ZCDMD_MASK                          equ 0001h
PMD2_CMP1MD_POSN                         equ 0001h
PMD2_CMP1MD_POSITION                     equ 0001h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0002h
PMD2_CMP2MD_POSN                         equ 0002h
PMD2_CMP2MD_POSITION                     equ 0002h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0004h
PMD2_ADCMD_POSN                          equ 0005h
PMD2_ADCMD_POSITION                      equ 0005h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0020h
PMD2_DACMD_POSN                          equ 0006h
PMD2_DACMD_POSITION                      equ 0006h
PMD2_DACMD_SIZE                          equ 0001h
PMD2_DACMD_LENGTH                        equ 0001h
PMD2_DACMD_MASK                          equ 0040h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0EE4h
// bitfield definitions
PMD3_CCP1MD_POSN                         equ 0000h
PMD3_CCP1MD_POSITION                     equ 0000h
PMD3_CCP1MD_SIZE                         equ 0001h
PMD3_CCP1MD_LENGTH                       equ 0001h
PMD3_CCP1MD_MASK                         equ 0001h
PMD3_CCP2MD_POSN                         equ 0001h
PMD3_CCP2MD_POSITION                     equ 0001h
PMD3_CCP2MD_SIZE                         equ 0001h
PMD3_CCP2MD_LENGTH                       equ 0001h
PMD3_CCP2MD_MASK                         equ 0002h
PMD3_PWM3MD_POSN                         equ 0002h
PMD3_PWM3MD_POSITION                     equ 0002h
PMD3_PWM3MD_SIZE                         equ 0001h
PMD3_PWM3MD_LENGTH                       equ 0001h
PMD3_PWM3MD_MASK                         equ 0004h
PMD3_PWM4MD_POSN                         equ 0003h
PMD3_PWM4MD_POSITION                     equ 0003h
PMD3_PWM4MD_SIZE                         equ 0001h
PMD3_PWM4MD_LENGTH                       equ 0001h
PMD3_PWM4MD_MASK                         equ 0008h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0EE5h
// bitfield definitions
PMD4_CWGMD_POSN                          equ 0000h
PMD4_CWGMD_POSITION                      equ 0000h
PMD4_CWGMD_SIZE                          equ 0001h
PMD4_CWGMD_LENGTH                        equ 0001h
PMD4_CWGMD_MASK                          equ 0001h
PMD4_MSSP1MD_POSN                        equ 0004h
PMD4_MSSP1MD_POSITION                    equ 0004h
PMD4_MSSP1MD_SIZE                        equ 0001h
PMD4_MSSP1MD_LENGTH                      equ 0001h
PMD4_MSSP1MD_MASK                        equ 0010h
PMD4_UART1MD_POSN                        equ 0006h
PMD4_UART1MD_POSITION                    equ 0006h
PMD4_UART1MD_SIZE                        equ 0001h
PMD4_UART1MD_LENGTH                      equ 0001h
PMD4_UART1MD_MASK                        equ 0040h
PMD4_CWG1MD_POSN                         equ 0000h
PMD4_CWG1MD_POSITION                     equ 0000h
PMD4_CWG1MD_SIZE                         equ 0001h
PMD4_CWG1MD_LENGTH                       equ 0001h
PMD4_CWG1MD_MASK                         equ 0001h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 0EE6h
// bitfield definitions
PMD5_DSMMD_POSN                          equ 0000h
PMD5_DSMMD_POSITION                      equ 0000h
PMD5_DSMMD_SIZE                          equ 0001h
PMD5_DSMMD_LENGTH                        equ 0001h
PMD5_DSMMD_MASK                          equ 0001h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0EE7h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0EE8h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0EE9h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h

